# JOIN Operations

## Introduction

The practice problems for this Lab provide hands on experience with the different kinds of join operations using the HR Database.

**IMPORTANT:** This lab assumes that you have already created and populated the tables below in a HR database schema in your local MySQL Database. If you have not done this yet, please open these links to **[create](https://github.com/ttadesusi/IBM-Data-Science-Professional-Certification/blob/master/5.%20Databases%20and%20SQL%20for%20Data%20Science/Script_Create_Tables.sql)** and **[insert/load](https://github.com/ttadesusi/IBM-Data-Science-Professional-Certification/blob/master/5.%20Databases%20and%20SQL%20for%20Data%20Science/PETSALE-CREATE.sql)** the data.

<center>
    <img src="https://drive.google.com/uc?id=1cZkI3_UOQ64vGDzolfJumoT-IKjMTMrj" width="800" alt="Sample HR Database" />
</center>

## Connection to MySQL Database

In [1]:
%load_ext sql

In [2]:
import os 

from dotenv import load_dotenv
load_dotenv() 

myuser = os.environ.get('mysql_username')      # e.g. 'root'
mypassword= os.environ.get('mysql_password')   # e.g. 'sample-password' 

connection_url = 'mysql://{user}:{password}@localhost/hr_database'.format(user=myuser,password=mypassword)

%sql {connection_url}

In [3]:
%%sql

show full tables

 * mysql://root:***@localhost/hr_database
5 rows affected.

[('departments', 'BASE TABLE'),
 ('employees', 'BASE TABLE'),
 ('job_history', 'BASE TABLE'),
 ('jobs', 'BASE TABLE'),
 ('locations', 'BASE TABLE')]

In [4]:
%%sql

select 
    *
from
    DEPARTMENTS;

 * mysql://root:***@localhost/hr_database
3 rows affected.

[('2', 'Architect Group', '30001', 'L0001'),
 ('5', 'Software Group', '30002', 'L0002'),
 ('7', 'Design Team', '30003', 'L0003')]

In [5]:
%%sql

select 
    *
from
    EMPLOYEES;

 * mysql://root:***@localhost/hr_database
10 rows affected.

[('E1001', 'John', 'Thomas', '123456', datetime.date(1976, 9, 1), 'M', '5631 Rice, OakPark,IL', '100', Decimal('100000.00'), '30001', '2'),
 ('E1002', 'Alice', 'James', '123457', datetime.date(1972, 7, 31), 'F', '980 Berry ln, Elgin,IL', '200', Decimal('80000.00'), '30002', '5'),
 ('E1003', 'Steve', 'Wells', '123458', datetime.date(1980, 10, 8), 'M', '291 Springs, Gary,IL', '300', Decimal('50000.00'), '30002', '5'),
 ('E1004', 'Santosh', 'Kumar', '123459', datetime.date(1985, 7, 20), 'M', '511 Aurora Av, Aurora,IL', '400', Decimal('60000.00'), '30004', '5'),
 ('E1005', 'Ahmed', 'Hussain', '123410', datetime.date(1981, 4, 1), 'M', '216 Oak Tree, Geneva,IL', '500', Decimal('70000.00'), '30001', '2'),
 ('E1006', 'Nancy', 'Allen', '123411', datetime.date(1978, 6, 2), 'F', '111 Green Pl, Elgin,IL', '600', Decimal('90000.00'), '30001', '2'),
 ('E1007', 'Mary', 'Thomas', '123412', datetime.date(1975, 5, 5), 'F', '100 Rose Pl, Gary,IL', '650', Decimal('65000.00'), '30003', '7'),
 ('E1008', 'Bharath', 'Gupta', '123413', datetime.date(1985, 6, 5), 'M', '145 Berry Ln, Naperville,IL', '660', Decimal('65000.00'), '30003', '7'),
 ('E1009', 'Andrea', 'Jones', '123414', datetime.date(1990, 9, 7), 'F', '120 Fall Creek, Gary,IL', '234', Decimal('70000.00'), '30003', '7'),
 ('E1010', 'Ann', 'Jacob', '123415', datetime.date(1982, 3, 30), 'F', '111 Britany Springs,Elgin,IL', '220', Decimal('70000.00'), '30004', '5')]

In [6]:
%%sql

select 
    * 
from 
    JOB_HISTORY;

 * mysql://root:***@localhost/hr_database
10 rows affected.

[('E1001', datetime.date(2000, 1, 8), '100', '2'),
 ('E1002', datetime.date(2001, 1, 8), '200', '5'),
 ('E1003', datetime.date(2001, 8, 16), '300', '5'),
 ('E1004', datetime.date(2000, 8, 16), '400', '5'),
 ('E1005', datetime.date(2000, 5, 30), '500', '2'),
 ('E1006', datetime.date(2001, 8, 16), '600', '2'),
 ('E1007', datetime.date(2002, 5, 30), '650', '7'),
 ('E1008', datetime.date(2010, 6, 5), '660', '7'),
 ('E1009', datetime.date(2016, 8, 16), '234', '7'),
 ('E1010', datetime.date(2016, 8, 16), '220', '5')]

In [7]:
%%sql

select 
    * 
from 
    JOBS;

 * mysql://root:***@localhost/hr_database
10 rows affected.

[('100', 'Sr. Architect', Decimal('60000.00'), Decimal('100000.00')),
 ('200', 'Sr. Software Developer', Decimal('60000.00'), Decimal('80000.00')),
 ('220', 'Sr. Designer', Decimal('70000.00'), Decimal('90000.00')),
 ('234', 'Sr. Designer', Decimal('70000.00'), Decimal('90000.00')),
 ('300', 'Jr.Software Developer', Decimal('40000.00'), Decimal('60000.00')),
 ('400', 'Jr.Software Developer', Decimal('40000.00'), Decimal('60000.00')),
 ('500', 'Jr. Architect', Decimal('50000.00'), Decimal('70000.00')),
 ('600', 'Lead Architect', Decimal('70000.00'), Decimal('100000.00')),
 ('650', 'Jr. Designer', Decimal('60000.00'), Decimal('70000.00')),
 ('660', 'Jr. Designer', Decimal('60000.00'), Decimal('70000.00'))]

In [8]:
%%sql

select 
    * 
from 
    LOCATIONS;

 * mysql://root:***@localhost/hr_database
3 rows affected.

[('L0001', '2'), ('L0002', '5'), ('L0003', '7')]

## Queries

#### Query 1A: Select the names and job start dates of all employees who work for the department number 5.

**Using Subqueries:** The outer query accesses the employees table and the subquery on job_history filters the result set of the outer query.

In [9]:
%%sql

select 
    F_NAME, L_NAME, START_DATE
from
    EMPLOYEES E,
    JOB_HISTORY JH
where
    E.EMPL_ID in (select
                      JH.EMPL_ID
                  from
                      JOB_HISTORY
                  where
                  JH.DEPT_ID = 5)
order by
   START_DATE,F_NAME;

 * mysql://root:***@localhost/hr_database
4 rows affected.

[('Santosh', 'Kumar', datetime.date(2000, 8, 16)),
 ('Alice', 'James', datetime.date(2001, 1, 8)),
 ('Steve', 'Wells', datetime.date(2001, 8, 16)),
 ('Ann', 'Jacob', datetime.date(2016, 8, 16))]

**Using Implicit Join:** it joins and displays the rows of both tables (`employees` and `job_history` ) without using the join operator explicitly.

In [10]:
%%sql

select 
    F_NAME, L_NAME, START_DATE
from
    EMPLOYEES E,
    JOB_HISTORY JH
where
    E.EMPL_ID = JH.EMPL_ID and E.DEPT_ID = 5
order by 
    START_DATE , F_NAME;

 * mysql://root:***@localhost/hr_database
4 rows affected.

[('Santosh', 'Kumar', datetime.date(2000, 8, 16)),
 ('Alice', 'James', datetime.date(2001, 1, 8)),
 ('Steve', 'Wells', datetime.date(2001, 8, 16)),
 ('Ann', 'Jacob', datetime.date(2016, 8, 16))]

**Using Inner Join:** displays only the rows of both tables (`job_history` and `employees`) that match the criteria speicified in the query.

In [11]:
%%sql

select 
    F_NAME, L_NAME, START_DATE
from
    EMPLOYEES E
        inner join
    JOB_HISTORY JH on E.EMPL_ID = JH.EMPL_ID
where 
    E.DEPT_ID = 5
order by 
    START_DATE, F_NAME;

 * mysql://root:***@localhost/hr_database
4 rows affected.

[('Santosh', 'Kumar', datetime.date(2000, 8, 16)),
 ('Alice', 'James', datetime.date(2001, 1, 8)),
 ('Steve', 'Wells', datetime.date(2001, 8, 16)),
 ('Ann', 'Jacob', datetime.date(2016, 8, 16))]

**Using Left Outer Join:** displays all the rows in the left table (`employees`) and combines the rows on the right table (`job_history`) that match the criteria speicified in the query.

In [12]:
%%sql

select 
    F_NAME, L_NAME, START_DATE
from
    EMPLOYEES E
        left join
    JOB_HISTORY JH on E.EMPL_ID = JH.EMPL_ID
where 
    E.DEPT_ID = 5
order by 
    START_DATE, F_NAME;

 * mysql://root:***@localhost/hr_database
4 rows affected.

[('Santosh', 'Kumar', datetime.date(2000, 8, 16)),
 ('Alice', 'James', datetime.date(2001, 1, 8)),
 ('Steve', 'Wells', datetime.date(2001, 8, 16)),
 ('Ann', 'Jacob', datetime.date(2016, 8, 16))]

**Using Right Outer Join:** displays all the rows in the right table (`job_history`) and combines the rows on the left table (`employees`) that match the criteria speicified in the query.

In [13]:
%%sql

select 
    F_NAME, L_NAME, START_DATE
from
    EMPLOYEES E
        right join
    JOB_HISTORY JH on E.EMPL_ID = JH.EMPL_ID
where 
    E.DEPT_ID = 5
order by 
    START_DATE, F_NAME;

 * mysql://root:***@localhost/hr_database
4 rows affected.

[('Santosh', 'Kumar', datetime.date(2000, 8, 16)),
 ('Alice', 'James', datetime.date(2001, 1, 8)),
 ('Steve', 'Wells', datetime.date(2001, 8, 16)),
 ('Ann', 'Jacob', datetime.date(2016, 8, 16))]

**Using Full Outer Join:** It displays all the rows from both tables (`employees` & `job_history`)

In [14]:
%%sql

select 
    F_NAME, L_NAME, START_DATE
from
    EMPLOYEES E
        left join
    JOB_HISTORY JH on E.EMPL_ID = JH.EMPL_ID
where 
    E.DEPT_ID = 5
    
union

select 
    F_NAME, L_NAME, START_DATE
from
    EMPLOYEES E
        right join
    JOB_HISTORY JH on E.EMPL_ID = JH.EMPL_ID
where 
    E.DEPT_ID = 5
    
order by 
START_DATE, F_NAME;

 * mysql://root:***@localhost/hr_database
4 rows affected.

[('Santosh', 'Kumar', datetime.date(2000, 8, 16)),
 ('Alice', 'James', datetime.date(2001, 1, 8)),
 ('Steve', 'Wells', datetime.date(2001, 8, 16)),
 ('Ann', 'Jacob', datetime.date(2016, 8, 16))]

***The above queries with different types of join operations give the same result. Unless it is specifically stated, any of the join operations can be used to retrieve information from the data set.***

#### Query 1B:  Select the names, job start dates, and job titles of all employees who work for the department number 5.

**Using Implicit Join:**

In [15]:
%%sql

select
    F_NAME, L_NAME, JOBS_TITLE
from 
    EMPLOYEES E,
    JOBS J
where
    E.JOBS_ID = J.JOBS_ID
    and E.DEPT_ID = 5
order by
   JOBS_TITLE,  F_NAME;

 * mysql://root:***@localhost/hr_database
4 rows affected.

[('Santosh', 'Kumar', 'Jr.Software Developer'),
 ('Steve', 'Wells', 'Jr.Software Developer'),
 ('Ann', 'Jacob', 'Sr. Designer'),
 ('Alice', 'James', 'Sr. Software Developer')]

**Using Inner Join:**

In [16]:
%%sql

select
    F_NAME, L_NAME, JOBS_TITLE
from 
    EMPLOYEES E
        inner join
    JOBS J on E.JOBS_ID = J.JOBS_ID
where
        E.DEPT_ID = 5
order by
   JOBS_TITLE,  F_NAME;

 * mysql://root:***@localhost/hr_database
4 rows affected.

[('Santosh', 'Kumar', 'Jr.Software Developer'),
 ('Steve', 'Wells', 'Jr.Software Developer'),
 ('Ann', 'Jacob', 'Sr. Designer'),
 ('Alice', 'James', 'Sr. Software Developer')]

#### Query 2A: Perform a Left Outer Join on the EMPLOYEES and DEPARTMENT tables and select employee id, last name, department id and department name for all employees

In [17]:
%%sql

select 
    EMPL_ID, L_NAME, E.DEPT_ID, DEPT_NAME
from
    EMPLOYEES E
        left join
    DEPARTMENTS D on E.DEPT_ID = D.DEPT_ID
order by
    DEPT_NAME, L_NAME;

 * mysql://root:***@localhost/hr_database
10 rows affected.

[('E1006', 'Allen', '2', 'Architect Group'),
 ('E1005', 'Hussain', '2', 'Architect Group'),
 ('E1001', 'Thomas', '2', 'Architect Group'),
 ('E1008', 'Gupta', '7', 'Design Team'),
 ('E1009', 'Jones', '7', 'Design Team'),
 ('E1007', 'Thomas', '7', 'Design Team'),
 ('E1010', 'Jacob', '5', 'Software Group'),
 ('E1002', 'James', '5', 'Software Group'),
 ('E1004', 'Kumar', '5', 'Software Group'),
 ('E1003', 'Wells', '5', 'Software Group')]

#### Query 2B: Re-write the query for 2A to limit the result set to include only the rows for employees born before 1980.

In [18]:
%%sql

select 
    EMPL_ID, L_NAME, E.DEPT_ID, DEPT_NAME
from
    EMPLOYEES E
        left join
    DEPARTMENTS D on E.DEPT_ID = D.DEPT_ID
where
    year(B_DATE) < 1980
order by
    DEPT_NAME, L_NAME;

 * mysql://root:***@localhost/hr_database
4 rows affected.

[('E1006', 'Allen', '2', 'Architect Group'),
 ('E1001', 'Thomas', '2', 'Architect Group'),
 ('E1007', 'Thomas', '7', 'Design Team'),
 ('E1002', 'James', '5', 'Software Group')]

#### Query 2C: Re-write the query for 2A to have the result set include all the employees but department names for only the employees who were born before 1980.

In [19]:
%%sql

select 
    EMPL_ID, L_NAME, E.DEPT_ID, DEPT_NAME
from
    EMPLOYEES E
        left join
    DEPARTMENTS D on E.DEPT_ID = D.DEPT_ID and year(B_DATE) < 1980
order by
    DEPT_NAME, L_NAME;

 * mysql://root:***@localhost/hr_database
10 rows affected.

[('E1008', 'Gupta', '7', None),
 ('E1005', 'Hussain', '2', None),
 ('E1010', 'Jacob', '5', None),
 ('E1009', 'Jones', '7', None),
 ('E1004', 'Kumar', '5', None),
 ('E1003', 'Wells', '5', None),
 ('E1006', 'Allen', '2', 'Architect Group'),
 ('E1001', 'Thomas', '2', 'Architect Group'),
 ('E1007', 'Thomas', '7', 'Design Team'),
 ('E1002', 'James', '5', 'Software Group')]

#### Query 3A: Perform a Full Join on the EMPLOYEES and DEPARTMENT tables and select the First name, Last name and Department name of all employees.

In [20]:
%%sql

select 
    F_NAME, L_NAME, DEPT_NAME
from
    EMPLOYEES E
        join
    DEPARTMENTS D on E.DEPT_ID = D.DEPT_ID
order by
    DEPT_NAME, F_NAME;

 * mysql://root:***@localhost/hr_database
10 rows affected.

[('Ahmed', 'Hussain', 'Architect Group'),
 ('John', 'Thomas', 'Architect Group'),
 ('Nancy', 'Allen', 'Architect Group'),
 ('Andrea', 'Jones', 'Design Team'),
 ('Bharath', 'Gupta', 'Design Team'),
 ('Mary', 'Thomas', 'Design Team'),
 ('Alice', 'James', 'Software Group'),
 ('Ann', 'Jacob', 'Software Group'),
 ('Santosh', 'Kumar', 'Software Group'),
 ('Steve', 'Wells', 'Software Group')]

#### Query 3B: Re-write Query 3A to have the result set include all employee names but department id and department names only for male employees.

**Using Left Join:**

In [21]:
%%sql

select 
    F_NAME, L_NAME, D.DEPT_ID, DEPT_NAME
from
    EMPLOYEES E
        left join
    DEPARTMENTS D on E.DEPT_ID = D.DEPT_ID and SEX = 'M'
order by
    DEPT_NAME, F_NAME;

 * mysql://root:***@localhost/hr_database
10 rows affected.

[('Alice', 'James', None, None),
 ('Andrea', 'Jones', None, None),
 ('Ann', 'Jacob', None, None),
 ('Mary', 'Thomas', None, None),
 ('Nancy', 'Allen', None, None),
 ('Ahmed', 'Hussain', '2', 'Architect Group'),
 ('John', 'Thomas', '2', 'Architect Group'),
 ('Bharath', 'Gupta', '7', 'Design Team'),
 ('Santosh', 'Kumar', '5', 'Software Group'),
 ('Steve', 'Wells', '5', 'Software Group')]

**Using Full Join:**

In [22]:
%%sql

select 
    F_NAME, L_NAME, D.DEPT_ID, DEPT_NAME
from
    EMPLOYEES E
        left join
    DEPARTMENTS D on E.DEPT_ID = D.DEPT_ID and SEX = 'M'
    
union

select 
    F_NAME, L_NAME, D.DEPT_ID, DEPT_NAME
from
    EMPLOYEES E
        right join
    DEPARTMENTS D on E.DEPT_ID = D.DEPT_ID and SEX = 'M'
    
order by
    DEPT_NAME, F_NAME;

 * mysql://root:***@localhost/hr_database
10 rows affected.

[('Alice', 'James', None, None),
 ('Andrea', 'Jones', None, None),
 ('Ann', 'Jacob', None, None),
 ('Mary', 'Thomas', None, None),
 ('Nancy', 'Allen', None, None),
 ('Ahmed', 'Hussain', '2', 'Architect Group'),
 ('John', 'Thomas', '2', 'Architect Group'),
 ('Bharath', 'Gupta', '7', 'Design Team'),
 ('Santosh', 'Kumar', '5', 'Software Group'),
 ('Steve', 'Wells', '5', 'Software Group')]

## Summary

In this lab you have learned how to work with different join operations using Python-SQL querries to retrieve information from MySQL database.

## Author

[Temitope Adesusi](https://www.linkedin.com/in/ttadesusi)

## Reference

[IBM Data Science](https://www.coursera.org/professional-certificates/ibm-data-science?) 

[Script to Create Table](https://github.com/ttadesusi/IBM-Data-Science-Professional-Certification/blob/master/5.%20Databases%20and%20SQL%20for%20Data%20Science/Script_Create_Tables.sql)

[Script to Insert Data to Table](https://github.com/ttadesusi/IBM-Data-Science-Professional-Certification/blob/master/5.%20Databases%20and%20SQL%20for%20Data%20Science/PETSALE-CREATE.sql)